In [1]:
people = {
    "first":["Corey","jane","john"],
    "last":["Schafer","Doe","Doe"],
    "email":["CoreyMschafer@gmail.com","JaneDoe@email.com","JohnDoe@email.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   jane      Doe        JaneDoe@email.com
2   john      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ["first_name","last_name","email"]

In [8]:
df.columns = [x.upper() for x in df.columns]

In [10]:
df.columns
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMschafer@gmail.com
1       jane       Doe        JaneDoe@email.com
2       john       Doe        JohnDoe@email.com

In [11]:
df.columns = [x.lower() for x in df.columns]

In [12]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMschafer@gmail.com
1       jane       Doe        JaneDoe@email.com
2       john       Doe        JohnDoe@email.com

In [13]:
df.columns = df.columns.str.replace(" ",'_')

In [14]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMschafer@gmail.com
1       jane       Doe        JaneDoe@email.com
2       john       Doe        JohnDoe@email.com

In [15]:
df.rename(columns = {"first_name":'first','last_name':'last'},inplace = True)

In [16]:
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   jane      Doe        JaneDoe@email.com
2   john      Doe        JohnDoe@email.com

In [17]:
df.loc[2]

first                 john
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [18]:
df.loc[2] = ['john','smith','johnsmith@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMschafer@gmail.com
1   jane      Doe        JaneDoe@email.com
2   john    smith      johnsmith@email.com

In [19]:
df.loc[2,['last','email']]=['Doe','JohnDoe@email.com']

In [23]:
df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [25]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [27]:
def update_enail(email):
    return email.upper()

In [28]:
df['email'].apply(update_enail)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [29]:
df['email'] = df['email'].apply(lambda x:x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   jane      Doe        janedoe@email.com
2   john      Doe        johndoe@email.com

In [31]:
 df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [32]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [34]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [35]:
len(df['email'])

3